## <Series 기본 24.03.06>

In [3]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

obj = pd.Series([4,7,-5,3])
obj
# obj = pd.Series([4.,7,-5,3]) 4.으로 바꾸면 다 .0이 붙음.

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [8]:
obj.index 
# 0~3 까지 step은 1이다.~~~

RangeIndex(start=0, stop=4, step=1)

index 변경가능 ㅜ

In [9]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

색인 - 값 연결 (산술연산가능~~ )

In [12]:
obj2['a']

-5

In [19]:
obj2['d'] = 6 # 6으로 변경
obj2[['c','a','d']]

'''index가 복수개면 [[]] 두개 써야한다'''

'index가 복수개면 [[]] 두개 써야한다'

----------- Dictionary -----------

In [20]:
sdata = {'Ohio': 35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000} #Python Dictionary 

obj3 = pd.Series(sdata)
obj3 # 자동으로 딕셔너리를 변경해줨

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

Series 객체에 이름을 붙일수 있고,  
그 안에 index도 이름 붙일 숭 있음.ㅎㅎ  
obj4.name = 'population'  #Series 객체에 name 속성부여
obj4.index.name = 'state' #Series 색인에 name 속성부여

In [24]:
states = ['California','Ohio','Oregon','Texas'] #색인을 직접 지정
obj4 = pd.Series(sdata, index=states)

In [25]:
obj4.name = 'population'  #Series 객체에 name 속성부여
obj4.index.name = 'state' #Series 색인에 name 속성부여

In [26]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
obj.index = ['Bob','Steve','Jeff','Ryan'] #색인은 대입하여 변경 할 수도 있다. 
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# <24.03.11>

In [4]:
import pandas as pd
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [5]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [6]:
frame.head() # 5개만 출력요.

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [7]:
frame.tail() # 뒤에서 5개만 출력요.

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [13]:
pd.DataFrame(data, columns=['year', 'state','pop'])
# 컬럼 순서 출력변경

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [11]:
pd.DataFrame(data, columns=['year', 'state'])

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [14]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [15]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [16]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [17]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [18]:
frame2['year'] # 얘는 Series 입니다.

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

< row 출력하기>

In [21]:
frame2.loc['three'] # 이건 Series 형식

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [23]:
frame2.loc[['two', 'three']] # 이건 DAtaframe 형식

       year state  pop debt
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [25]:
frame2['debt'] = 16.5 # 전체 대입 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [28]:
import numpy as np
frame2['debt'] = np.arange(6.0)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [29]:
#리스트나 배열을 컬럼에 대입할때는 길이가 DataFrame의 크기와 동일해야 한다.
#Series를 대입하면 DataFrame의 색인에 따라 값이 대입되며, 존재하지 않는 색인에는 NaN이 대입된다. 
val = pd.Series([-1.2, -1.5, -1.7], index = ['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [31]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year state  pop  debt  eastern
one    2000  Ohio  1.5   NaN     True
two    2001  Ohio  1.7  -1.2     True
three  2002  Ohio  3.6   NaN     True
four   2001  Ohio  2.4  -1.5     True
five   2002  Ohio  2.9  -1.7     True
six    2003  Ohio  3.2   NaN     True

In [32]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [33]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [37]:
frame3.T
# 행과 열을 바꾸기

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [38]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [39]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}  #frame3['Nevada'][:-1]과 같은 결과
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [40]:
#name 속성 지정
frame3.index.name = 'year'
frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [41]:
obj=pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [42]:
#위의 Series객체에 reindex를 호출하면 새로운 색인에 맞게 재배열하고, 존재하지 않는 색인값이 있다면 NaN을 추가한다.
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [43]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [44]:
#시계열 같은 순차적 데이터를 재색인할때 값을 보간하거나 채워넣을경우가 있다. 
#method 옵션을 사용해서 이를 해결할수 있으며, ffill 같은 매서드를 사용해서 누락된값을 직전의 값으로 채울 수 있다.
obj3.reindex(range(6), method='ffill')  #bfil과 비교

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [45]:
obj3.reindex(range(6), method='bfill')  #bfil과 비교

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [47]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','b','c'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [48]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [49]:
new_obj = obj.drop('c')  # del obj['c']  #예약어 del을 사용해도 됨
new_obj
# 새로운 객체에다가 넣어야함.

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [50]:
#레이블 이름으로 슬라이싱하면 시작점과 끝점을 포함한다. 파이썬의 슬라이싱과 다른점을 확인.
obj['b':'c']

b    1.0
c    2.0
dtype: float64

### loc와 iloc로 선택하기
#### 축의 이름을 선택할때는 loc
#### 정수 색인으로 선택할때는 iloc

In [52]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data.loc['Ohio']

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [54]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [55]:
data.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [56]:
data.loc[:'Utah', 'two'] # 인덱스 이름으로 하면 유타 포함임!!!!

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

### 정수 색인
#### pandas는 리스트나 튜플과 같은 파이썬 내장 자료구조와 색인방법이 차이가 있다.

In [57]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [64]:
# ser[-1] 이건 오류남 
ser[: -1] #이건 안남 ㅋ

0    0.0
1    1.0
dtype: float64

In [67]:
ser2 = pd.Series(np.arange(3.), index=['a','b','c']) 
#정수 기반의 색인을 사용하지 않으면 이러한 모호함은 사라진다.
ser2[-1] # 정수면은 이거 가능 ㅎㅎ

2.0

In [68]:
ser[:1] # index 0만 출력

0    0.0
dtype: float64

In [69]:
ser.loc[:1] # loc는 숫자가 아니고 location. 1을 포함함요.

0    0.0
1    1.0
dtype: float64

In [70]:
ser.iloc[:1] # 이건 index 0 만 출력

0    0.0
dtype: float64

In [71]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [72]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [73]:
df1 = pd.DataFrame({'A': [1,2]})
df2 = pd.DataFrame({'B': [3,4]})

In [74]:
#공통되는 컬럼 라벨이나 로우 라벨이 없는 경우 결과가 없다.
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [75]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [76]:
df2.loc[1,'b'] = np.nan

In [77]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [80]:
df1.add(df2, fill_value = 100) # NaN값을 다 100으로 변경해라.

       a      b      c      d      e
0    0.0    2.0    4.0    6.0  104.0
1    9.0  105.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

# <24.03.13>

In [5]:
import pandas as pd
import numpy as np

frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns=list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]

In [6]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [7]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [11]:
#색인값을 찾을수가 없으면 객체는 형식을 맞추기 위해 재색인 된다.
series2 = pd.Series(range(3), index=['b','e','f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [10]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [12]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [14]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), 
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.298688  1.230596  0.950725
Ohio    1.574440  1.482081  0.245076
Texas  -1.638423  0.983575  0.498395
Oregon -1.767459  0.803371  0.225872

In [15]:
np.abs(frame)

               b         d         e
Utah    0.298688  1.230596  0.950725
Ohio    1.574440  1.482081  0.245076
Texas   1.638423  0.983575  0.498395
Oregon  1.767459  0.803371  0.225872

In [17]:
f = lambda x : x.max() - x.min()
frame.apply(f)
# abs 안된값에서 뺀거임.

b    3.341899
d    0.678710
e    0.724852
dtype: float64

In [20]:
# 이번엔 컬럼에 적용하기
frame.apply(f, axis='columns')

             min       max
Utah   -0.298688  1.230596
Ohio    0.245076  1.574440
Texas  -1.638423  0.983575
Oregon -1.767459  0.803371

In [21]:
frame

               b         d         e
Utah   -0.298688  1.230596  0.950725
Ohio    1.574440  1.482081  0.245076
Texas  -1.638423  0.983575  0.498395
Oregon -1.767459  0.803371  0.225872

In [19]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -1.767459  0.803371  0.225872
max  1.574440  1.482081  0.950725

In [22]:
format = lambda x : '%.2f' % x
frame.applymap(format)

            b     d     e
Utah    -0.30  1.23  0.95
Ohio     1.57  1.48  0.25
Texas   -1.64  0.98  0.50
Oregon  -1.77  0.80  0.23

In [23]:
frame['e']. map(format)

Utah      0.95
Ohio      0.25
Texas     0.50
Oregon    0.23
Name: e, dtype: object

### 정렬과 순위

In [26]:
# sort_index 메소드
obj = pd.Series(range(4), index=['d','a','b','c'])
obj.sort_index() # 인덱스를 sorting 하라.

a    1
b    2
c    3
d    0
dtype: int64

In [27]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three','one'],
                    columns = ['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [28]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [29]:
frame.sort_index(axis=1) # 행을 sorting

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [33]:
frame.sort_index(axis=1, ascending=False) # 오름,내림차순!

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [34]:
#Series 객체를 값에 따라 정렬하고 싶으면 sort_value 사용  /index 도가능
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

obj.sort_values() # 값을 sorting

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [35]:
frame = pd.DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [36]:
frame.sort_values() # 오류남. 왜냐면 series는 행이 하나밖에 없으니까 
# 무러 기준으로 sorting 해라 안하면 오류잼.

TypeError: sort_values() missing 1 required positional argument: 'by'

In [38]:
# by 를 넣어서 합니다.
frame.sort_values(by = 'b')
# b 값 기준으로 sorting 합니다.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [39]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [41]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj
# 인덱스가 없으니 자동으로 0부터 부여짐.

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [43]:
obj.rank() # 순위 매기기~~~~~`~~~ 
# 값   : 7 -5 7  4 2 0 4
# 순위 : 6  1 7  4 3 2 5

# 작은 수 대로 순서 매김요. 같으면 평균으로 .5로 마무으리...

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [45]:
# 중복 되어 .5 가 나오는 경우를 없앰
# 순서에 따라 순위를 매길때는 'first'
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [46]:
# 내림차순, 동률인경우, 그룹 내에서 높은 순으로 적용한다. 
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

# 중복색인

In [47]:
obj = pd.Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [48]:
obj.index.is_unique # index에 중복값이 있는지 체크

False

In [50]:
obj['a'] # 중복됨.

a    0
a    1
dtype: int64

In [52]:
df = pd.DataFrame(np.random.randn(4,3), index=['a','a','b','b'])
df
# frame 에서도 마찬가지.

          0         1         2
a  0.440185  0.336452  1.381656
a  1.141042  0.091663 -2.402385
b -2.428232  0.500240  0.297167
b -0.762855  1.919213  0.273817

In [53]:
df.loc['a']

          0         1         2
a  0.440185  0.336452  1.381656
a  1.141042  0.091663 -2.402385

In [54]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75,-1.3]],
                 index=['a','b','c','d'],
                 columns=['one','two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [56]:
df.sum() # NaN 제외

one    9.25
two   -5.80
dtype: float64

In [57]:
df.sum(axis='columns')# nan은 0으로 취급.

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [58]:
# mean 은 둘다 nan 일경우 nan으로 나옴.
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [61]:
#'skipna'옵션을 사용해서 NaN을 제외할지 결정
df.mean(axis='columns', skipna=False) # skip nan.

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [62]:
df.idxmax()
#index 출력

one    b
two    d
dtype: object

In [63]:
#누적(accumulation) 합
df.cumsum()
# c = a+b
# d = a+b+c 이런느낌

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [64]:
#여러개의 통계 결과를 출력
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [65]:
conda install pandas-datareader

^C

Note: you may need to restart the kernel to use updated packages.

# 유일값, 값 세기, 멤버십

In [70]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [71]:
uniques = obj.unique()  #중복되는 값을 제거하고, 유리한 값만 담고있는 Series를 반환한다.
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [73]:
obj.value_counts()  
#Series에서 도수(frequency)를 내림차순으로 정령하여 계산한다.

c    3
a    3
b    2
d    1
dtype: int64

In [75]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [78]:
unique_vals = obj.unique()
pd.Index(unique_vals).get_indexer(obj)
# 인덱스 출략구결굮려ㅜㄱ

array([0, 1, 2, 1, 1, 3, 3, 0, 0], dtype=int64)